Courses/7140/Lectures/Comprehension/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-27 Sun 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Comprehension</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Comprehension</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4694926">1. Collected Quotes</a></li>
<li><a href="#orge473990">2. Comprehension How To</a></li>
<li><a href="#org681b5ed">3. Browsing Tools</a></li>
<li><a href="#orge030083">4. Reverse Engineering</a></li>
<li><a href="#orgc309d66">5. Design Extraction</a></li>
<li><a href="#org6a31bd6">6. Operations on Source Code</a></li>
<li><a href="#orgcc3a95a">7. Obfuscation</a></li>
<li><a href="#orged9b2c5">8. Good/ Responsible Software Development</a></li>
<li><a href="#org1141449">9. Books on (Well-Documented) Specific Programs</a></li>
<li><a href="#orgc35643e">10. Reading List</a></li>
</ul>
</div>
</div>
<p>
Abstract: What does it take to understand the source code of [large]
programs that you did not participate in?  Do you have the src code?
Do you have its RSDI-docs?
</p>

<div id="outline-container-org4694926" class="outline-2">
<h2 id="org4694926"><span class="section-number-2">1</span> Collected Quotes</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>"Here is a not uncommon scenario in many workplaces. A neophyte
[&#x2026;]  programmer is assigned to maintain, debug, or enhance an
application.  The atmosphere is sink or swim, the system is
complex, the code is sophisticated, the documentation is scant, and
the programmer is bewildered.  Questions slowly take shape.  What,
exactly, am I supposed to do?  What part(s) of the application need
my attention?  Will a change to program X affect program Y?  And,
most critically, where do I start? What the poor programmer needs
is a strategy for comprehending the program, then finding the sweet
spots in the code as efficiently as possible."  [from
<a href="http://www2.sas.com/proceedings/sugi27/p068-27.pdf">http://www2.sas.com/proceedings/sugi27/p068-27.pdf</a> ]</li>

<li>"Legacy systems have one or several of the following attributes:
they were implemented many years ago, their technology became
obsolete, their structure deteriorated, they represent a large
investment, they contain business rules not recorded elsewhere,
they cannot be easily replaced, or the original authors are not
available. Software comprehension typically consumes more than a
half of the difficult effort of maintaining legacy systems."  [from
Rajlich, ICSE, 1997]</li>

<li>"I have never inherited a codebase I liked."  Anonymous Developer.</li>
</ol>
</div>
</div>

<div id="outline-container-orge473990" class="outline-2">
<h2 id="orge473990"><span class="section-number-2">2</span> Comprehension How To</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>What are the (expected) givens?
<ol class="org-ol">
<li>Source code files</li>
<li>RSDI-docs
<ol class="org-ol">
<li>Requirements Document</li>
<li>Specs Document</li>
<li>Design Document</li>
<li>Implementation Document</li>
<li>Testing Document</li>
</ol></li>
<li>Even in the best-run projects, any thing more than source code
files, is a bonanza.  Contribute such examples!</li>
</ol></li>

<li>Learn enough about the domain of the software:

<ol class="org-ol">
<li>E.g., Compilers. You cannot expect to understand a compiler
project without understanding parsing, code generation, etc.
literature.</li>

<li>This is true even for simple things, e.g., Tic-Tac-Toe.</li>
</ol></li>

<li>Browse the Empirical Software Engineering journal, special issue on
Program Comprehension, Volume 18, Issue 2, April 2013
<a href="http://link.springer.com/journal/10664/18/2/page/1">http://link.springer.com/journal/10664/18/2/page/1</a>  Read the Preface.</li>

<li>Generate "Design Documents"

<ol class="org-ol">
<li>using whatever tools, but must be "dependable" (produce usable
info)</li>

<li>inserting prose annotations</li>

<li>progressively improving prose annotations into
verifiable/executable assertions</li>
</ol></li>

<li>Recall that assertions can be written as executable boolean
methods in the implementation language without side-effects.</li>

<li>Code refactoring
<ol class="org-ol">
<li>Often done to "improve"</li>
<li>Here do it to "understand", by breaking into pieces</li>
</ol></li>
</ol>
</div>
</div>


<div id="outline-container-org681b5ed" class="outline-2">
<h2 id="org681b5ed"><span class="section-number-2">3</span> Browsing Tools</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Browsing == Code Inspection</li>

<li>Stand alone (tiny) tools: {ctags, etags, javadoc, &#x2026;}</li>

<li><a href="http://doxygen.org">http://doxygen.org</a> Open source documentation system for software
written in C++, C#, Java, Python, IDL, C and more.  Can generate
Class relationship diagrams and file relationships.</li>

<li><a href="https://www.google.com/search?q=static-analysis-plugins-for-intellij">https://www.google.com/search?q=static-analysis-plugins-for-intellij</a></li>
<li><a href="https://www.google.com/search?q=static-analysis-plugins-for-eclipse">https://www.google.com/search?q=static-analysis-plugins-for-eclipse</a></li>

<li>Source Navigator can display relationships between classes,
functions, members, and display call trees mapping unknown source
code for enhancement or maintenance tasks.  For
C/C++.  2014. Development stopped?
<a href="http://sourcenav.sourceforge.net/">http://sourcenav.sourceforge.net/</a></li>

<li>1 <a href="http://lxr.linux.no/">http://lxr.linux.no/</a> 2 <a href="https://elixir.bootlin.com/linux/latest/source">https://elixir.bootlin.com/linux/latest/source</a>
3 <a href="https://code.woboq.org/linux/linux/">https://code.woboq.org/linux/linux/</a> Linux source code browsers</li>

<li><a href="https://www.gnu.org/software/global/links.html">https://www.gnu.org/software/global/links.html</a> 'Source code
reading' related sites</li>

<li>Commercial Tools: JArchitect, NDepend, &#x2026; [Free Trials?][Search
for links]</li>

<li>P. Anderson; M. Zarins, The CodeSurfer Software Understanding
Platform Program Comprehension, 2005. IWPC 2005. Proceedings. 13th
International Workshop on (January 2005), 2005, pg. 147-148.  Reference.
<a href="http://www.grammatech.com/research/technologies/codesurfer">http://www.grammatech.com/research/technologies/codesurfer</a>
[Commercial; free trial]</li>
</ol>
</div>
</div>

<div id="outline-container-orge030083" class="outline-2">
<h2 id="orge030083"><span class="section-number-2">4</span> Reverse Engineering</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Reversing binary files is termed Reverse Code Engineering, or RCE.
Often used in malware analysis.</li>

<li>Obfuscation is used to deter both reverse engineering and re-engineering.</li>

<li>Canfora, et al., see Refs. Required Reading</li>

<li>Tool: IDA <a href="https://www.hex-rays.com/products/ida/">https://www.hex-rays.com/products/ida/</a> Runs on 
Linux,  Mac OS X, or Windows.  "IDA has become the de-facto standard for the
analysis of hostile code, &#x2026;"  [Commercial; free download and
trial.] [free educational licenses]</li>
<li>Tool: Ghidra <a href="https://github.com/NationalSecurityAgency/ghidra">https://github.com/NationalSecurityAgency/ghidra</a> NSA
Ghidra Software Reverse Engineering Framework, 2020 active FOSS.
Runs on Linux, Mac OS X, or Windows.</li>
</ol>
</div>
</div>


<div id="outline-container-orgc309d66" class="outline-2">
<h2 id="orgc309d66"><span class="section-number-2">5</span> Design Extraction</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Extracting design details from src code.</li>
<li>Source code is reverse-engineered back to &#x2026; design &#x2026; specs.</li>
</ol>
</div>
</div>

<div id="outline-container-org6a31bd6" class="outline-2">
<h2 id="org6a31bd6"><span class="section-number-2">6</span> Operations on Source Code</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Program Slicing: What could have affected this variable’s value?  A
program slice with respect to a given variable, v, is a set of
variables the values of which can influence that of v.
<a href="https://en.wikipedia.org/wiki/Program_slicing">https://en.wikipedia.org/wiki/Program_slicing</a></li>

<li>Ripple analysis: If a given statement is modified, where does it
affect?  And, how?</li>

<li>Mutation.
<a href="http://sites.utexas.edu/august/files/2020/08/ASEDEMO2018.pdf">http://sites.utexas.edu/august/files/2020/08/ASEDEMO2018.pdf</a>
SRCIROR: A Toolset for Mutation Testing of C Source Code and LLVM
Intermediate Representation</li>
</ol>
</div>
</div>

<div id="outline-container-orgcc3a95a" class="outline-2">
<h2 id="orgcc3a95a"><span class="section-number-2">7</span> Obfuscation</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>[dictionary def] Obfuscate: tr.v. -cated, -cating, -cates.
<ol class="org-ol">
<li>To render obscure.</li>
<li>To darken.</li>
<li>To confuse: his emotions obfuscated his judgment.
[LLat. obfuscare, to darken : ob(intensive) + Lat. fuscare,
to darken &lt; fuscus, dark.] -obfuscation n. obfuscatory adj</li>
</ol></li>

<li>There are companies that practice obfuscation to thwart reverse
engineering.</li>

<li><a href="http://www.ioccc.org/">http://www.ioccc.org/</a> The International Obfuscated C Code Contest
<ol class="org-ol">
<li>To write the most Obscure/Obfuscated C program within the rules.</li>
<li>To show the importance of programming style, in an ironic way.</li>
<li>To stress C compilers with unusual code.</li>
<li>To illustrate some of the subtleties of the C language.</li>
<li>To provide a safe forum for poor C code. :-)</li>
<li>Source code of winning programs is included.</li>
<li>27th Contest happened in 2020 <a href="http://www.ioccc.org/2020/whowon.html">http://www.ioccc.org/2020/whowon.html</a></li>
</ol></li>

<li><a href="https://www.google.com/webhp?ion=1&amp;espv=2&amp;ie=UTF-8#newwindow=1&amp;q=java+bytecode+obfuscator">Google search</a> for java bytecode obfuscator</li>
</ol>
</div>
</div>

<div id="outline-container-orged9b2c5" class="outline-2">
<h2 id="orged9b2c5"><span class="section-number-2">8</span> Good/ Responsible Software Development</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>To help future readers of your software.</li>

<li><a href="../Design/design-by-contract.html">Design-by-Contract</a></li>

<li>Standard Literate Programming tools on Linux: cweb, cweave,
ctangle; noweb; &#x2026;</li>

<li><a href="http://www.ssw.uni-linz.ac.at/Research/Projects/RevLitProg/">http://www.ssw.uni-linz.ac.at/Research/Projects/RevLitProg/</a> " a
system which allows &#x2026;  selective browsing.  Zoom in at
interesting points or jump to other locations according to control
flow or other semantic relationships.  This is the approach of
hypertext.  &#x2026; Reverse Literate Programming &#x2026;"</li>

<li><a href="https://dzone.com/articles/literate-programming-life">https://dzone.com/articles/literate-programming-life</a> Literate
Programming Life Cycle 2010</li>
</ol>
</div>
</div>


<div id="outline-container-org1141449" class="outline-2">
<h2 id="org1141449"><span class="section-number-2">9</span> Books on (Well-Documented) Specific Programs</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>Knuth's Computers &amp; Typesetting,
<a href="https://www-cs-faculty.stanford.edu/~knuth/abcde.html">https://www-cs-faculty.stanford.edu/~knuth/abcde.html</a> TeX: The
Program, and Metafont.  The .web files of these can be legitimately
downloaded.  [PDF
<a href="http://visualmatheditor.equatheque.net/doc/texbook.pdf">http://visualmatheditor.equatheque.net/doc/texbook.pdf</a> legit?]</li>

<li>Tanenbaum's example OS Design: Minix; Operating Systems Design and
Implementation (3rd Edition), ISBN-13: 978-0131429383</li>

<li>Operating Systems: Principles and Practice, Second Edition, by
Thomas Anderson and Michael Dahlin.  <a href="https://xinu.cs.purdue.edu/">https://xinu.cs.purdue.edu/</a></li>

<li>Jim Welsh and Atholl Hay: A Model Implementation of Standard
Pascal, Prentice Hall, 1986</li>

<li>Niklaus Wirth, et al. <a href="http://www.projectoberon.com/">http://www.projectoberon.com/</a> "Project Oberon
is a design for a complete desktop computer system from scratch.
&#x2026; Project Oberon: The Design of an Operating System, a Compiler,
and a Computer &#x2013; written by the designers, Niklaus Wirth and Jürg
Gutknecht."  <a href="https://people.inf.ethz.ch/wirth/">https://people.inf.ethz.ch/wirth/</a></li>
</ol>
</div>
</div>


<div id="outline-container-orgc35643e" class="outline-2">
<h2 id="orgc35643e"><span class="section-number-2">10</span> Reading List</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>Many refs are embedded in the above.</li>
<li><a href="http://www.program-comprehension.org/">http://www.program-comprehension.org/</a>  Recommended Visit.  For awareness.</li>

<li>Marouane Kessentini, W. Kessentini, H. Sahraoui, M. Boukadoum and
A. Ouni, "Design Defects Detection and Correction by Example," 2011
IEEE 19th International Conference on Program Comprehension,
Kingston, ON, 2011, pp. 81-90, doi: 10.1109/ICPC.2011.22.  Required
Reading.</li>

<li>Russell Wood, <a href="http://www3.imperial.ac.uk/pls/portallive/docs/1/18619750.PDF">"Assisted Software Comprehension"</a>, A Project Report,
June 2003; {Is this a BS/ MS thesis from Imperial College London?}
Reference.</li>

<li>Gerardo Canfora, Massimiliano Di Penta, Luigi Cerulo, "Software
Reverse Engineering: Achievements and Challenges", Communications
of the ACM, Volume 54 Issue 4, Pages 142-151, 2011.  Required
Reading.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2020-09-27
</div>
</body>
</html>
